app/controllers/burgers_controller.rb

SELECT "burgers".* FROM "burgers"
---
    def index
        burgers = Burger.all

SELECT "burgers".* FROM "burgers" WHERE "burgers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        burger = Burger.find(params[:id]);

SELECT "burgers".* FROM "burgers" WHERE (recipe_id = '1' )
---
    def ingredients
        recipeID = params['id']
        thisBurgersIngredients = Burger.where("recipe_id = ? ", recipeID)