app/controllers/ingredients_controller.rb

SELECT "ingredients".* FROM "ingredients"
---
  def index
    ingredients = Ingredient.all

SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def show
    ingredient = Ingredient.find_by(id: params[:id])